package com.wzb;

/**
 * 单元测试入门
 *
 */
public class TestStart {
    public static void main(String[] args) {
        /*
        测试是用来鉴定软件正确性、完整性、安全性以及软件质量的过程

        测试阶段划分：
        1.单元测试、2.集成测试、3.系统测试、4.验收测试；其中只有单元测试和集成测试需要开发人员关注

        1.单元测试
        对软件的基本组成单位进行测试，是最小的测试单位
        目的是为了检测软件基本组成单位的正确性

        2.集成测试
        将已经通过测试的单元，按设计要求组合成系统或子系统，再进行测试
        目的是为了检查单元之间的协作是否正确


        测试方法：
            1.白盒测试：
            清楚软件的内部结构及代码逻辑，用于验证代码、逻辑的正确性
            2.黑盒测试：
            不清楚软件的内部结构及代码逻辑，只是用于验证软件的功能、兼容性
            3.灰盒测试：
            结合了白盒测试和黑盒测试的特点，既关注软件的内部结构又关注其功能实现、

         */

        /*
        Junit单元测试入门
        Junit是最流行的Java测试框架之一，提供一些功能便于单元测试

        为什么不使用main方法进行测试？
        main方法的确可以用于测试，但是存在一些问题：
        1.测试代码和源代码没有分开，难以维护
        2.一个方法出现异常，程序直接停止，会影响后面的方法
        3.无法自动化测试，得到测试报告

        那么使用Junit的优势就是没有以上的问题


         */
    }
}
